[
    {
      "title": "Ingénieur Cloud & DevOps",
      "subtitle": "Depuis Octobre 2024 à aujourd'hui, Sophia Antipolis, France",
      "image_link": "atos_logo",
      "image_alt": "Atos logo",
      "content": [
        "- <b>IAC</b> (Infrastructure as Code) avec Terraform et Ansible pour <b>mettre en place</b> des envrionnements et les <b>configurer</b>.",
        "- <b>CI/CD</b> avec GitLab pour automatiser le déploiement des applications et création de pipelines et de composants pour <b>automatiser</b> les déploiements.",
        "- Cloud avec Outscale pour <b>déployer</b> des applications et <b>gérer</b> les ressources cloud.",
        "- Conteneurs avec podman, Kubernetes & Openshift pour <b>déployer</b> des applications et <b>gérer</b> les conteneurs."
      ],
      "stack": [
        "Terraform",
        "Ansible",
        "GitLab",
        "Kubernetes",
        "Bash"
      ]
    },
    {
      "title": "Mobilité Internationale USA (Stage)",
      "subtitle": "D'Avril 2024 à Mai 2024 à Thuasne USA, Kansas City, USA",
      "image_link": "thuasne_logo",
      "image_alt": "Thuasne logo",
      "content": [
        "Durant mon stage aux <b>États-Unis</b>, j'ai eu l'opportunité de découvrir l'architecture IT actuelle de <b>Thuasne USA</b> et les enjeux et défis liés à la <b>migration</b> vers un <b>domaine commun</b> quand de petites entreprises se font racheter par une plus grandes.",
        "Au cours de mon séjour, j'ai eu l'occasion de <b>former</b> des collaborateurs sur les technologies <b>Azure & IoT</b>. J'ai également travaillé avec des équipes de l'entreprise sur un potentiel projet d'équiper des chaussettes de capteurs <b>IoT</b> et de <b>transmission des données</b> vers le <b>Cloud Azure</b>.",
        "En outre, j'ai travaillé sur un projet de <b>digitalisation de la ligne de production</b>, visant à remplacer les feuilles papier par des documents électroniques accessibles via SharePoint. J'ai <b>conçu</b> et <b>mis en place</b> une <b>architecture Azure</b> qui permet de rendre <b>dynamique</b> des QR codes. Ceci fut <b>indispensable</b> car les ordres de commandes et autres documents imprimés tous les jours <b>changent</b>. Or la nature d'un QR code est <b>immutable</b> puisqu'il est généré en fonction de ce qu'on lui associe. Ainsi, il fallait rendre les documents associés aux QR codes, <b>dynamiques</b>.",
        "Enfin, j'ai pu fournir une <b>documentation détaillée</b> sur ce travail, son fonctionnement et comment le déployer. J'ai pu suivre et travailler avec mon collègue, Solution Architecte, et j'ai vu les enjeux liés à la <b>communication</b> avec les collaborateurs. Il est essentiel de comprendre les <b>besoins</b> de l'entreprise, de suivre les <b>processus</b> et de gérer les <b>résistances au changement</b>. J'ai compris que la <b>digitalisation</b> peut être un moyen de réduire les coûts et d'améliorer l'efficacité, mais il est également important de prendre en compte les besoins et les préférences des employés.",
        "Ainsi, ce stage m'a permis de <b>développer</b> mes compétences en matière de technologie, de communication (notamment en anglais) et de collaboration, et j'en suis revenu avec une expérience enrichissante et des compétences renforcées."
      ],
      "stack": [
        "Azure",
        "Anglais",
        "IoT",
        "Digitalisation"
      ]
    },
    {
      "title": "Ingénieur Cloud (Alternance)",
      "subtitle": "De Septembre 2021 à Septembre 2024 à Thuasne, Lyon, France",
      "image_link": "thuasne_logo",
      "image_alt": "Thuasne logo",
      "content": [
        "Pendant mon apprentissage chez Thuasne, j'ai eu l'opportunité de travailler sur une large gamme de projets, dont beaucoup étaient liés à l'<b>IoT</b> (Internet des Objets) et fortement dépendant des <b>technologies cloud</b>. J'ai ainsi pu découvrir le cloud et forger une importante expérience avec Azure. Pour le déploiement d'applications, j'ai appris et utilisé Kubernetes et Docker, assurant des solutions <b>efficaces et évolutives</b>. J'ai également entrepris des tâches de <b>développement pur</b>, prenant une application existante et la migrant vers les dernières versions de Vue et Loopback. Mon travail s'est étendu à différents langages de programmation, dont Python, Java, PHP et JavaScript, démontrant ainsi ma <b>capacité d'adaptation et ma polyvalence</b> face à des piles technologiques diverses.",
        "J'ai également travaillé sur un projet de développement d'une application utilisant <b>FHIR</b> (Fast Healthcare Interoperability Resources), ce qui impliquait la création d'une <b>API REST</b> pour gérer les données des patients. L'idée principale du projet était de créer une plateforme de bout en bout où les données des appareils IoT sont ingestées et intégrées au flux de travail du patient. Tout cela afin de rendre les données visibles sur le cloud par les médecins et les patients eux-mêmes. Ce projet a été particulièrement stimulant, car il m'a fallu apprendre beaucoup de choses, y compris <b>FHIR</b>, les <b>réglementations sur les données de santé</b>, les <b>bonnes pratiques cloud</b>, et la capacité à fournir un <b>code et une architecture de haute qualité</b>."
      ],
      "stack": [
        "Azure",
        "Kubernetes",
        "Docker",
        "Vue",
        "Loopback",
        "Python",
        "Spring Boot",
        "FHIR"
      ]
    },
    {
      "title": "Développeur Python (Stage)",
      "subtitle": "D'Avril 2021 à Juillet 2021 à Ciril Group, Lyon, France",
      "image_link": "ciril_group_logo",
      "image_alt": "Ciril Group logo",
      "content": [
        "Au cours de mon stage chez Ciril Group j'ai pu <b>développer</b> une application utilisant Scrapy en Python. Cette application était conçue pour récupérer automatiquement les adresses de différents points de vente sur Internet (grande surface, restaurants...). Elle disposait d'une liste prédéfinie de chaînes de distribution et naviguait sur le site web de chaque chaîne pour extraire toutes les adresses des magasins. Ensuite, les adresses étaient <b>traitées</b>, <b>nettoyées</b> et <b>stockées</b> pour une utilisation et une cartographie ultérieures. Cette expérience a renforcé ma maîtrise du <b>web scraping</b> et du traitement des données, ainsi que ma capacité à créer des solutions pratiques pour les <b>besoins commerciaux réels</b>.",
        "Cette expérience fut ma première expérience professionnelle et m'a permis de renforcer ma maîtrise du <b>web scraping</b> et du traitement des données, ainsi que ma capacité à créer des solutions pratiques pour les <b>besoins commerciaux réels</b>."
      ],
      "stack": [
        "Python",
        "Scrapy",
        "Pandas"
      ]
    }
  ]
  