[
    {
      "title": "Ingénieur Cloud & DevOps",
      "subtitle": "Depuis Octobre 2024 à aujourd'hui, Sophia Antipolis, France",
      "image_link": "atos_logo",
      "image_alt": "Atos logo",
      "content": [
        "Membre d’une équipe de <b>Platform Engineering</b> en charge de <b>l’architecture</b>, du <b>déploiement</b> et de la <b>migration</b> d’une <b>plateforme DevOps à l’échelle entreprise</b>.",
        "</br><b class='text-primary'>1 - Migration & Modernisation OpenShift</b>",
        "<ul class='list-disc list-outside ml-5'>",
        "<li>Contribution à la <b>transition technique</b> d’OpenShift Container Platform 3 vers 4 avec une <b>refonte complète des pipelines CI/CD</b> (Jenkins → GitLab CI/CD).</li>",
        "<li><b>Piloté la migration de Kustomize vers des Helm Charts standardisés</b> intégrant les conventions organisationnelles et les outils de la plateforme (PostgreSQL via CloudNativePG, secrets Vault, sauvegardes S3, autoscaling HPA).</li>", 
        "<li>Mise en place de <b>conteneurs rootless</b> et de <b>politiques</b> Velero pour renforcer la <b>sécurité</b>.</li>",
        "<li class='impact'><b>Impact :</b> migration de <b>70+ applications sans interruption de service</b>, <b>70% de réduction du temps de déploiement</b>, <b>20% de diminution de la surface d’attaque</b> et <b>100% d’adoption</b> des Helm Charts standardisés par toutes les équipes.</li>",
        "</ul>",
        "</br><b class='text-primary'>2 - Platform Engineering & Expérience Développeur</b>",
        "<ul class='list-disc list-outside ml-5'>",
        "<li>Participation à <b>l’architecture</b> et au <b>déploiement</b> d’une <b>plateforme CI/CD en self‑service</b> (GitLab CI/CD, ArgoCD, Nexus, Vault, OpenShift 4) pour <b>accélérer le time‑to‑market</b>.</li>", 
        "<li>Création de <b>composants GitLab réutilisables</b> permettant aux développeurs de déployer en production sans expertise pipeline (build, test, lint, scan sécurité, SBOM, push registry).</li>", 
        "<li><b>Automatisation Ansible</b> pour un provisionnement complet (création de dépôts GitLab, configuration Nexus, namespaces Kubernetes).</li>", 
        "<li class=impact><b>Impact :</b> déploiement sur <b>6+ clusters</b> (prod, dev, staging), adoption par <b>30+ équipes</b>, <b>70% de réduction du temps de déploiement</b> (≈3 semaines → 2 jours) et <b>85% de réduction du temps d’onboarding</b>, avec <b>quasi 0% de downtime</b> durant la migration. Formation et accompagnement de <b>50+ développeurs</b> à l’usage de la plateforme.</li>",
        "</ul>",
        "</br><b class='text-primary'>3 - Déploiement Air‑Gap & Haute Sécurité</b>",
        "<ul class='list-disc list-outside ml-5'>",
        "<li>Déploiement complet de la plateforme sur un cluster OpenShift en mode <b>air‑gap</b> (sans accès Internet) avec <b>contraintes de sécurité maximales</b>.</li>", 
        "<li>Configuration de registres miroirs, transfert hors‑ligne de <b>300+ images conteneurs</b> et adaptation des pipelines CI/CD pour un environnement déconnecté.</li>", 
        "<li class=impact><b>Impact :</b> plateforme opérationnelle conservant <b>100% des fonctionnalités</b> en environnement haute sécurité, <b>documentation technique complète</b> (architecture, runbooks) et validation de conformité pour une <b>production sensible</b>.</li>",
        "</ul>",
        "</br><b class='text-primary'>4 - Contributions transverses</b>",
        "<ul class='list-disc list-outside ml-5'>",
        "<li><b>Infrastructure as Code</b> et <b>Provisioning</b> (Terraform/Ansible/Outscale).</li>", 
        "<li><b>Optimisation des coûts</b> Cloud (<span class=impact><b>-20% de coûts</b> via l’automatisation de l’arrêt des VM hors horaires ouvrés</span>).</li>", 
        "<li>Tableaux de <b>monitoring</b> par projet avec <b>alerting</b>.</li>",
        "<li>Interconnexion <b>SSO interne</b>.</li>",
        "</ul>"
      ],
      "stack": [
        "Kubernetes",
        "OpenShift",
        "ArgoCD",
        "Helm", 
        "GitLab",
        "Ansible",
        "Nexus",
        "HashiCorp Vault", 
        "Terraform"
      ]
    },
    {
      "title": "Mobilité Internationale USA (Stage)",
      "subtitle": "D'Avril 2024 à Mai 2024 à Thuasne USA, Kansas City, USA",
      "image_link": "thuasne_logo",
      "image_alt": "Thuasne logo",
      "content": [
        "Mission internationale au sein d’une filiale américaine <b>récemment</b> acquise pour <b>l’évaluation technologique</b>, la <b>validation de POC</b> et la <b>formation Azure</b>.",
        "</br><b class='text-primary'>1 - Digitalisation de la ligne de production</b>",
        "<ul class='list-disc list-outside ml-5'>",
        "<li><b>Conçu une solution cloud</b> pour éliminer les documents papier sur les lignes de production malgré la contrainte technique de <b>documents variables quotidiennement</b>.</li>",
        "<li><b>Innovation</b> : architecture de QR codes <b>« statiques-dynamiques »</b> (Azure Functions + SharePoint) permettant <b>une impression unique</b> du code avec un contenu <b>modifiable dynamiquement</b> via un système de routage dynamique.</li>",
        "<li class=impact><b>Impact</b> : <b>POC fonctionnel</b> démontré aux opérateurs, <b>documentation technique complète</b>, et business case validé avec <b>12k$/an d’économies</b> (<b>1 200+ impressions couleur/mois évitées</b>, <b>85% de réduction</b> du temps d’accès à l’information), permettant <b>l’approbation budgétaire</b> et la planification du déploiement par l’équipe locale.</li>",
        "</ul>",
        "</br><b class='text-primary'>2 - Formation & Transfert de connaissances</b>",
        "<ul class='list-disc list-outside ml-5'>",
        "<li><b>Mené une mission de transfert de connaissances et d’évaluation technologique</b> suite à l’acquisition de Knitrite sous la bannière Thuasne USA par le groupe français.</li>",
        "<li>Animé des <b>ateliers Azure/IoT</b> (Digital Twin, IoT Hub, Serverless Functions...) afin d’aligner les équipes locales sur les <b>standards cloud du groupe</b>.</li>",
        "<li class='impact'><b>Impact</b> : formé <b>une douzaine de collaborateurs</b> (IT, production, management), documenté les <b>écarts technologiques et organisationnels</b>, et fourni des <b>recommandations stratégiques</b> pour la migration vers <b>Azure Cloud</b>.</li>",
        "</ul>"
      ],
      "stack": [
        "Azure",
        "Anglais",
        "IoT",
        "Digitalisation"
      ]
    },
    {
      "title": "Ingénieur Cloud (Alternance)",
      "subtitle": "De Septembre 2021 à Septembre 2024 à Thuasne, Lyon, France",
      "image_link": "thuasne_logo",
      "image_alt": "Thuasne logo",
      "content": [
        "Membre de l’équipe <b>R&D</b> pilotant la transformation <b>cloud</b> et <b>IoT</b> dans l’industrie des dispositifs <b>médicaux</b>, fournissant des <b>solutions de santé innovantes</b> sur Azure.",
        "</br><b class='text-primary'>1 - Développement d’une plateforme Cloud-Native IoT Santé</b>",
        "<ul class='list-disc list-outside ml-5'>",
        "<li><b>Dirigé la migration et l’amélioration</b> d’une <b>plateforme cloud-native de bout en bout</b> sur Azure pour l’ingestion et la gestion de <b>données médicales IoT conformes FHIR</b>.</li>",
        "<li><b>Migration d’un VPS vers une architecture Kubernetes (AKS)</b> orchestrant l’<b>intégration en temps réel</b> des données issues de dispositifs médicaux connectés vers un portail sécurisé patient/médecin conforme au <b>RGPD/HDS</b>, utilisant VueJS et Loopback.</li>",
        "<li class=impact><b>Impact (encore en développement)</b> : plateforme pilote capable de gérer <b>8 000+ dispositifs IoT</b> avec <b>95% de disponibilité</b>, visant à réduire le temps de transmission des données vitales de <b>65%</b> et permettant un suivi digitalisé.</li>",
        "</ul>",
        "</br>",
        "<b class='text-primary'>2 - Automatisation ML/OCR pour la digitalisation des formulaires de fabrication sur mesure</b>",
        "<ul class='list-disc list-outside ml-5'>",
        "<li><b>Conçu et déployé</b> une <b>solution cloud automatisée de digitalisation</b> utilisant <b>Azure Cognitive Services (OCR)</b> pour traiter des formulaires manuscrits de mesures orthopédiques.</li>",
        "<li><b>Intégration</b> dans le système de production d’orthèses sur mesure via une <b>API REST</b> déployée sur <b>Kubernetes</b>.</li>",
        "<li class=impact><b>Impact (Proof Of Concept)</b> : <b>250+ formulaires traités quotidiennement</b> avec <b>94% de précision</b>, réduisant le temps de saisie manuelle de <b>80%</b> et éliminant <b>85% des erreurs de transcription</b>, accélérant les délais de fabrication pour <b>15 000+ patients/an</b>.</li>",
        "</ul>",
        "</br><b class='text-primary'>3 - Réconciliation de données multi‑sources dans un catalogue produit unifié</b>",
        "<ul class='list-disc list-outside ml-5'>",
        "<li><b>Conçu un système de réconciliation de données multi‑sources en temps réel</b> (SQL Server, PostgreSQL, MongoDB) vers CosmosDB afin de créer la <b>première API unifiée des articles du groupe</b>.</li>",
        "<li>Utilisation combinée de <b>Azure Durable Functions</b> et <b>Azure Data Factory</b> pour orchestrer la <b>synchronisation distribuée</b> de 3 bases de données hétérogènes à travers le groupe et ses filiales.</li>",
        "<li class=impact><b>Impact</b> : catalogue unifié de <b>65 000+ références produits</b> avec une latence de synchronisation <b><20 min</b>, exposé via une <b>API REST</b> consommée par plusieurs systèmes métiers, réduisant les incohérences de données de <b>70%</b> et permettant le lancement d’une <b>API de référence produit unifiée</b>.</li>",
        "</ul>"
      ],
      "stack": [
        "Azure",
        "FHIR",
        "IoT",
        "Kubernetes",
        "Python",
        "Docker",
        "Vue",
        "Loopback",
        "Spring Boot"
      ]
    },
    {
      "title": "Développeur Python (Stage)",
      "subtitle": "D'Avril 2021 à Juillet 2021 à Ciril Group, Lyon, France",
      "image_link": "ciril_group_logo",
      "image_alt": "Ciril Group logo",
      "content": [
        "<b>Première expérience professionnelle</b> avec le développement d’une application de web scraping <b>prête pour la production</b> dédiée à la <b>collecte et la cartographie</b> de données pour la grande distribution.",
        "</br><b class='text-primary'>1 - Conception d’une application de Web Scraping</b>",
        "<ul class='list-disc list-outside ml-5'>",
        "<li><b>Conçu et développé</b> une solution d’automatisation Python/Scrapy pour <b>collecter à grande échelle</b> les adresses de points de vente à l’échelle nationale, rendant possible un projet auparavant <b>impossible à réaliser manuellement</b>.</li>", 
        "<li>L’application parcourt <b>automatiquement</b> les sites de <b>25+</b> enseignes (supermarchés, restaurants) pour <b>extraire</b>, <b>nettoyer</b> et <b>normaliser</b> les données géographiques.</li>",
        "<li class=impact><b>Impact</b> : collecte de <b>30 000+</b> adresses avec <b>95%</b> de précision en <b>quelques jours vs. plusieurs mois en traitement manuel</b>, permettant le déploiement d’une nouvelle solution de géolocalisation pour les besoins métier de l’entreprise.</li>",
        "</ul>"
      ],
      "stack": [
        "Python",
        "Scrapy",
        "Pandas"
      ]
    }
  ]
  